/*

这个是专门放变量的js
文件存放组织结构为：全局、空气、光强、水、、、、等。
每个结构下面分为控制模块和poi点。

注意命名规范，缩进正确。

2020/01/16 许耿瑞
*/

// kqdatabase=[]
// --------------------------全局  主页数据----------------------------------- // 
kqdatabase=[[]];

ziyemiandata =["zhuye","kongqi","shuizhi","guangqiang", "shushi", "yingyang","jianshen", "kangyi", "renyuan"]


//首 页 数 据

timeweek=["3/15","3/16","3/17","3,18","3/19","3/20","3/21"]   //s一周的时间坐标
timeday=["8:00","9:00","10:00","11:00","12:00","13:00","14:00"]   // 一天的时间坐标，倒推七个小时


// kqdata=[kqdatabase[0][1],kqdatabase[0][5],kqdatabase[0][2],kqdatabase[0][6],kqdatabase[0][2],kqdatabase[0][3]]//空气数据  温度，湿度，甲醛 voc pm2.5 co2
kqdata=[1,11,1,1,1,1]
setTimeout(function(){kqdata=[kqdatabase[0][1],kqdatabase[0][5],kqdatabase[0][2],kqdatabase[0][6],kqdatabase[0][2],kqdatabase[0][3]]//空气数据  温度，湿度，甲醛 voc pm2.5 co2
}, 3000);




waterdata=[3,3,2,0.4] // 浑浊度，PH,电导率，余氯




voice=[30,50]      //室内 室外  噪声 




jsdata1=[60,50,70,80,50,90,80]  //健身人数
jsdata2=[40,50,30,20,50,10,20]   //总人数-健身人数
jsdata3=50  //实时健身人数





////舒适  数据定义

 
var shushidata = [
    {
        name: '舒适',
        value: voice[0]       /////噪声
    },{
        name: '舒适',
        value: 30                     //////空气质量  未定义？？？
    },{
        name: '舒适',
        value: kqdata[1]                  //////湿度
    },{
        name: '舒适',
        value: kqdata[0]                 //////温度
    }]

    ////消毒记录
quyu=['办公室','茶水间','会议室','走廊','洗手间','洽谈室','电梯间']
xiaodudata=['已消毒','已消毒','待消毒','已消毒','待消毒','已消毒','已消毒']
xiaodutime=['3.01     18:00','2.29     18:00' ,'2.28     18:00','2.27     18:00','2.26     18:00','2.25     18:00','2.24     18:00']

////人员占地密度指标
renyuandata=[10,20,30,40,50,61]   ////办公区人数，会议区人数，来访人数，开窗数，开门数，门窗状态






// --------------------------空气子页面     单独用历史数据----------------------------------- //
///kqdata    同首页
airco2data=[300,500,400,600,1000,900,1050]  ///co2  7天
airvocdata=[500,700,600,550,400,500,600]    ///voc  7d
airtemdata=[25,22,23,25,23,24,25]          //tem   7d
airhumdata=[30,40,35,50,60,55,65]        //hum 7d
airhumdataday=[30,40,35,50,60,55,65,50]      //hum 7h

airpm25data=[10,5,20,8,25,15,3]          //pm25  7d
airchohdata=[10, 20,15 , 10, 20];     //choh  按区域




// --------------------------水质子页面     单独用历史数据----------------------------------- //
hunzhuodu=[0.7,1.0,1.5,0.8,0.6,0.3,0.2]   ///浑浊度，七天数据
yulv=[0.35,0.45,0.3,0.4,0.35,0.2,0.5]      /////余氯，七天数据
diandaolv=[1000,1500,1300,1600,1700,1300,1400]    ///电导率  七天数据
waterphdata=[9,8.5,6,7.5,7,6.5,8]    //ph  七天数据


squyu=['茶水间1','茶水间2','茶水间3','办公室']  ////滤芯位置
sxiaodudata=['正常','正常','正常','告警']     /////滤芯情况
sxiaodutime=['3.01     18:00','2.29     18:00','2.28     18:00','2.27     18:00']/////上次更换滤芯时间



// --------------------------光子页面     单独用历史数据----------------------------------- //
jielvlightdata=[200,300,100,500,350,400,300,320,500]

outlightdata=[200,300,400,300,200,300,0,300,200]//室外光强数据      7h
gdata3=300   //实时，室内光
gdata4=1000  //实时，室外光
inlightdata1=[400,300,200,300,400,500,400,300,400] //室内光强数据   7h   //会议室
inlightdata2=[400,300,200,300,400,500,400,300,400] //室内光强数据   7h   //办公区1
inlightdata3=[400,300,200,300,400,500,400,300,400] //室内光强数据   7h    //办公区2


weekinlightdata1=[400,300,200,300,400,500,400,300,400] //室内光强数据   7d  会议室
weekinlightdata2=[400,300,200,300,400,500,400,300,400] //室内光强数据   7d   办公区1
weekinlightdata3=[400,300,200,300,400,500,400,300,400] //室内光强数据   7d   办公区2
weekoutlightdata=[400,300,200,300,400,500,400,300,400]  //室外光强数据   7d  











// --------------------------人员子页面     单独用历史数据----------------------------------- //
bangongrenshu=[200,150,120,100,70,20,20]
qingjiarenshu=[13,10,5,15,12,0,6]
laifangrenshu=[13,10,5,15,12,0,6]




