/*

这个是专门放变量的js
文件存放组织结构为：全局、空气、光强、水、、、、等。
每个结构下面分为控制模块和poi点。

注意命名规范，缩进正确。

2020/01/16 许耿瑞
*/


// --------------------------全局场景----------------------------------- //

ziyemiandata =["zhuye","kongqi","guangqiang", "shushi", "szyy","jianshen", "kangyi", "zonghe"]


kqdata=[50,50,25,30,40,80]//空气数据  温度，湿度，甲醛 voc pm2.5 co2
waterdata=[3,3,2,0.4] // 浑浊度，PH,电导率，余氯
gdata1=[400,300,200,300,400,500,400,300,400] //室内光强数据
gdata2=[200,300,400,300,200,300,0,300,200]//室外光强数据
gdata3=1000    //实时，室内光
gdata4=300  //实时，室外光
jsdata1=[60,50,70,80,50,90,80]  //健身人数
jsdata2=[40,50,30,20,50,10,20]   //总人数-健身人数
jsdata3=50  //实时健身人数




////舒适  数据定义

 
var shushidata = [
    {
        name: '舒适',
        value: 54
    },{
        name: '舒适',
        value: 30
    },{
        name: '优秀',
        value: 35
    },{
        name: '优秀',
        value: 40
    }]